시계열 데이터 분석

In [56]:
import pandas as pd

date_str = "2024-03-26"

# datetime
# string >> datetime : to_datetime()
pd.to_datetime(date_str)

datetime_obj = pd.to_datetime(date_str)
print(datetime_obj)

2024-03-26 00:00:00

In [57]:
print(type(date_str))
print(type(datetime_obj))

<class 'str'>
<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [58]:
date_string = ["2024-03-26"]

pd.to_datetime(date_string)
datetime_obj = pd.to_datetime(date_string)
print(datetime_obj)
print(type(datetime_obj))

DatetimeIndex(['2024-03-26'], dtype='datetime64[ns]', freq=None)
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [59]:
pd.read_csv("./data/raw_sales.csv")

                  datesold  postcode   price propertyType  bedrooms
0      2007-02-07 00:00:00      2607  525000        house         4
1      2007-02-27 00:00:00      2906  290000        house         3
2      2007-03-07 00:00:00      2905  328000        house         3
3      2007-03-09 00:00:00      2905  380000        house         4
4      2007-03-21 00:00:00      2906  310000        house         3
...                    ...       ...     ...          ...       ...
29575  2019-07-25 00:00:00      2900  500000         unit         3
29576  2019-07-25 00:00:00      2612  560000         unit         2
29577  2019-07-26 00:00:00      2912  464950         unit         2
29578  2019-07-26 00:00:00      2601  589000         unit         2
29579  2019-07-26 00:00:00      2612  775000         unit         2

[29580 rows x 5 columns]

In [60]:
raw = pd.read_csv("./data/raw_sales.csv")

In [61]:
sales = raw.copy()

In [62]:
PATH = "./data/raw_sales.csv"

In [63]:
pd.read_csv(PATH)

                  datesold  postcode   price propertyType  bedrooms
0      2007-02-07 00:00:00      2607  525000        house         4
1      2007-02-27 00:00:00      2906  290000        house         3
2      2007-03-07 00:00:00      2905  328000        house         3
3      2007-03-09 00:00:00      2905  380000        house         4
4      2007-03-21 00:00:00      2906  310000        house         3
...                    ...       ...     ...          ...       ...
29575  2019-07-25 00:00:00      2900  500000         unit         3
29576  2019-07-25 00:00:00      2612  560000         unit         2
29577  2019-07-26 00:00:00      2912  464950         unit         2
29578  2019-07-26 00:00:00      2601  589000         unit         2
29579  2019-07-26 00:00:00      2612  775000         unit         2

[29580 rows x 5 columns]

In [64]:
sales = pd.read_csv(PATH)

In [65]:
sales.head(3)

              datesold  postcode   price propertyType  bedrooms
0  2007-02-07 00:00:00      2607  525000        house         4
1  2007-02-27 00:00:00      2906  290000        house         3
2  2007-03-07 00:00:00      2905  328000        house         3

In [66]:
sales.shape

(29580, 5)

In [67]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29580 entries, 0 to 29579
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datesold      29580 non-null  object
 1   postcode      29580 non-null  int64
 2   price         29580 non-null  int64
 3   propertyType  29580 non-null  object
 4   bedrooms      29580 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB

In [68]:
sales.columns

Index(['datesold', 'postcode', 'price', 'propertyType', 'bedrooms'], dtype='object')

In [69]:
pd.to_datetime(sales['datesold'])

0       2007-02-07
1       2007-02-27
2       2007-03-07
3       2007-03-09
4       2007-03-21
           ...
29575   2019-07-25
29576   2019-07-25
29577   2019-07-26
29578   2019-07-26
29579   2019-07-26
Name: datesold, Length: 29580, dtype: datetime64[ns]

In [70]:
# 컬럼의 데이터 형식 변경(문자 >> 날짜형식)
sales['datesold'] = pd.to_datetime(sales['datesold'])

In [71]:
sales.head(3)

    datesold  postcode   price propertyType  bedrooms
0 2007-02-07      2607  525000        house         4
1 2007-02-27      2906  290000        house         3
2 2007-03-07      2905  328000        house         3

In [72]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29580 entries, 0 to 29579
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datesold      29580 non-null  datetime64[ns]
 1   postcode      29580 non-null  int64
 2   price         29580 non-null  int64
 3   propertyType  29580 non-null  object
 4   bedrooms      29580 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.1+ MB

In [73]:
sales['datesold'].max()

Timestamp('2019-07-27 00:00:00')

In [74]:
sales['datesold'].min()

Timestamp('2007-02-07 00:00:00')

In [75]:
sales['datesold'].max() - sales['datesold'].min()

Timedelta('4553 days 00:00:00')

In [76]:
sales['datesold'] .dt.year

0        2007
1        2007
2        2007
3        2007
4        2007
         ...
29575    2019
29576    2019
29577    2019
29578    2019
29579    2019
Name: datesold, Length: 29580, dtype: int32

In [77]:
sales['datesold'] .dt.month

0        2
1        2
2        3
3        3
4        3
        ..
29575    7
29576    7
29577    7
29578    7
29579    7
Name: datesold, Length: 29580, dtype: int32

In [78]:
sales['datesold'] .dt.day

0         7
1        27
2         7
3         9
4        21
         ..
29575    25
29576    25
29577    26
29578    26
29579    26
Name: datesold, Length: 29580, dtype: int32

In [79]:
# 새로운 컬럼명 생성
# 파생변수
sales['year'] = sales['datesold'] .dt.year
sales['month'] = sales['datesold'] .dt.month
sales['day'] = sales['datesold'] .dt.day

# print(sales['year'])

In [80]:
sales.head(3)

    datesold  postcode   price propertyType  bedrooms  year  month  day
0 2007-02-07      2607  525000        house         4  2007      2    7
1 2007-02-27      2906  290000        house         3  2007      2   27
2 2007-03-07      2905  328000        house         3  2007      3    7

shift

- 데이터프레임이나 시리즈(Series) 내의 데이터를 지정된 만큼의 기간 동안 위나 아래로 이동시키는 기능을 제공
- 왜 써요? 차분(diff)

In [81]:
sales.head()

    datesold  postcode   price propertyType  bedrooms  year  month  day
0 2007-02-07      2607  525000        house         4  2007      2    7
1 2007-02-27      2906  290000        house         3  2007      2   27
2 2007-03-07      2905  328000        house         3  2007      3    7
3 2007-03-09      2905  380000        house         4  2007      3    9
4 2007-03-21      2906  310000        house         3  2007      3   21

In [84]:
sales.loc[:, ["datesold","price"]]

        datesold   price
0     2007-02-07  525000
1     2007-02-27  290000
2     2007-03-07  328000
3     2007-03-09  380000
4     2007-03-21  310000
...          ...     ...
29575 2019-07-25  500000
29576 2019-07-25  560000
29577 2019-07-26  464950
29578 2019-07-26  589000
29579 2019-07-26  775000

[29580 rows x 2 columns]

In [87]:
temp_df = sales.loc[:, ["datesold","price"]].copy()
print(temp_df.head(3))

    datesold   price
0 2007-02-07  525000
1 2007-02-27  290000
2 2007-03-07  328000

In [89]:
print(temp_df['price'].shift(1))
print('-'*30)
print(temp_df['price'].shift(2))

0             NaN
1        525000.0
2        290000.0
3        328000.0
4        380000.0
           ...
29575    475000.0
29576    500000.0
29577    560000.0
29578    464950.0
29579    589000.0
Name: price, Length: 29580, dtype: float64
------------------------------
0             NaN
1             NaN
2        525000.0
3        290000.0
4        328000.0
           ...
29575    380000.0
29576    475000.0
29577    500000.0
29578    560000.0
29579    464950.0
Name: price, Length: 29580, dtype: float64

In [93]:
print(temp_df['price'].shift(1,fill_value=0))
print(type(temp_df['price'].shift(1,fill_value=0)))
print('-'*30)
print(temp_df['price'].shift(2,fill_value=0))
print(type(temp_df['price'].shift(2,fill_value=0)))

0             0
1        525000
2        290000
3        328000
4        380000
          ...
29575    475000
29576    500000
29577    560000
29578    464950
29579    589000
Name: price, Length: 29580, dtype: int64
<class 'pandas.core.series.Series'>
------------------------------
0             0
1             0
2        525000
3        290000
4        328000
          ...
29575    380000
29576    475000
29577    500000
29578    560000
29579    464950
Name: price, Length: 29580, dtype: int64
<class 'pandas.core.series.Series'>

In [95]:
# astype()
print(temp_df['price'].shift(1,fill_value=0).astype(int))
print(type(temp_df['price'].shift(1,fill_value=0).astype(int)))
print('-'*30)
print(temp_df['price'].shift(2,fill_value=0).astype(int))
print(type(temp_df['price'].shift(2,fill_value=0).astype(int)))

0             0
1        525000
2        290000
3        328000
4        380000
          ...
29575    475000
29576    500000
29577    560000
29578    464950
29579    589000
Name: price, Length: 29580, dtype: int32
<class 'pandas.core.series.Series'>
------------------------------
0             0
1             0
2        525000
3        290000
4        328000
          ...
29575    380000
29576    475000
29577    500000
29578    560000
29579    464950
Name: price, Length: 29580, dtype: int32
<class 'pandas.core.series.Series'>

In [98]:
# astype()
temp_df['shifted_v1'] = temp_df['price'].shift(1,fill_value=0).astype(int)
temp_df['shifted_v2'] = temp_df['price'].shift(2,fill_value=0).astype(int)

temp_df.head()

    datesold   price  shifted_v1  shifted_v2
0 2007-02-07  525000           0           0
1 2007-02-27  290000      525000           0
2 2007-03-07  328000      290000      525000
3 2007-03-09  380000      328000      290000
4 2007-03-21  310000      380000      328000

In [101]:
# 한글 날짜 추가

temp_df['한글날짜'] = temp_df['datesold'].dt.strftime("%Y년 %m월 %d일")
# Y : 2007, y : 07
temp_df.head()

    datesold   price  shifted_v1  shifted_v2           한글날짜
0 2007-02-07  525000           0           0  2007년 02월 07일
1 2007-02-27  290000      525000           0  2007년 02월 27일
2 2007-03-07  328000      290000      525000  2007년 03월 07일
3 2007-03-09  380000      328000      290000  2007년 03월 09일
4 2007-03-21  310000      380000      328000  2007년 03월 21일

In [102]:
temp_df['한글날짜'] = temp_df['datesold'].dt.strftime("%y년 %m월 %d일")
# Y : 2007, y : 07
temp_df.head()

    datesold   price  shifted_v1  shifted_v2         한글날짜
0 2007-02-07  525000           0           0  07년 02월 07일
1 2007-02-27  290000      525000           0  07년 02월 27일
2 2007-03-07  328000      290000      525000  07년 03월 07일
3 2007-03-09  380000      328000      290000  07년 03월 09일
4 2007-03-21  310000      380000      328000  07년 03월 21일

In [103]:
# 실데이터 분석에 응용해 보기

PATH ='./data/출동_지연시간.csv'

In [104]:
pd.read_csv(PATH)

    소방서                 출발시간                 도착시간
0     4  2023-01-01 00:00:00  2023-01-01 00:59:00
1     8  2023-01-01 01:00:00  2023-01-01 02:02:00
2     6  2023-01-01 02:00:00  2023-01-01 03:19:00
3     6  2023-01-01 03:00:00  2023-01-01 04:22:00
4     1  2023-01-01 04:00:00  2023-01-01 05:22:00
..  ...                  ...                  ...
95   10  2023-01-04 23:00:00  2023-01-05 00:07:00
96    2  2023-01-05 00:00:00  2023-01-05 01:59:00
97    7  2023-01-05 01:00:00  2023-01-05 02:33:00
98    9  2023-01-05 02:00:00  2023-01-05 02:30:00
99    9  2023-01-05 03:00:00  2023-01-05 03:35:00

[100 rows x 3 columns]

In [106]:
raw = pd.read_csv(PATH)
df = raw.copy()
df.head(3)

   소방서                 출발시간                 도착시간
0    4  2023-01-01 00:00:00  2023-01-01 00:59:00
1    8  2023-01-01 01:00:00  2023-01-01 02:02:00
2    6  2023-01-01 02:00:00  2023-01-01 03:19:00

In [108]:
df.shape
# 100개의 관측 데이터, 3개의 컬럼(속성)

(100, 3)

In [110]:
df.info()
# 찍는 이유 : non-null 유무, 데이터 타입 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   소방서     100 non-null    int64
 1   출발시간    100 non-null    object
 2   도착시간    100 non-null    object
dtypes: int64(1), object(2)
memory usage: 2.5+ KB

In [111]:
df.columns

Index(['소방서', '출발시간', '도착시간'], dtype='object')

In [113]:
df['start'] = pd.to_datetime(df['출발시간'])
df['end'] = pd.to_datetime(df['도착시간'])

df.head(3)

,소방서,출발시간,도착시간,start,end
0,4,2023-01-01 00:00:00,2023-01-01 00:59:00,2023-01-01 00:00:00,2023-01-01 00:59:00
1,8,2023-01-01 01:00:00,2023-01-01 02:02:00,2023-01-01 01:00:00,2023-01-01 02:02:00
2,6,2023-01-01 02:00:00,2023-01-01 03:19:00,2023-01-01 02:00:00,2023-01-01 03:19:00

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   소방서     100 non-null    int64
 1   출발시간    100 non-null    object
 2   도착시간    100 non-null    object
 3   start   100 non-null    datetime64[ns]
 4   end     100 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 4.0+ KB

In [115]:
# 날짜(시간) 차이 계산
df['지연시간'] = df['end'] - df['start']

df.head(3)

,소방서,출발시간,도착시간,start,end,지연시간
0,4,2023-01-01 00:00:00,2023-01-01 00:59:00,2023-01-01 00:00:00,2023-01-01 00:59:00,0 days 00:59:00
1,8,2023-01-01 01:00:00,2023-01-01 02:02:00,2023-01-01 01:00:00,2023-01-01 02:02:00,0 days 01:02:00
2,6,2023-01-01 02:00:00,2023-01-01 03:19:00,2023-01-01 02:00:00,2023-01-01 03:19:00,0 days 01:19:00

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   소방서     100 non-null    int64
 1   출발시간    100 non-null    object
 2   도착시간    100 non-null    object
 3   start   100 non-null    datetime64[ns]
 4   end     100 non-null    datetime64[ns]
 5   지연시간    100 non-null    timedelta64[ns]
dtypes: datetime64[ns](2), int64(1), object(2), timedelta64[ns](1)
memory usage: 4.8+ KB

In [117]:
df['지연시간']

0    0 days 00:59:00
1    0 days 01:02:00
2    0 days 01:19:00
3    0 days 01:22:00
4    0 days 01:22:00
           ...
95   0 days 01:07:00
96   0 days 01:59:00
97   0 days 01:33:00
98   0 days 00:30:00
99   0 days 00:35:00
Name: 지연시간, Length: 100, dtype: timedelta64[ns]

In [121]:
print(df['지연시간'])
print('--'*20)
print(df['지연시간'].dt.total_seconds())
print('--'*20)

0    0 days 00:59:00
1    0 days 01:02:00
2    0 days 01:19:00
3    0 days 01:22:00
4    0 days 01:22:00
           ...
95   0 days 01:07:00
96   0 days 01:59:00
97   0 days 01:33:00
98   0 days 00:30:00
99   0 days 00:35:00
Name: 지연시간, Length: 100, dtype: timedelta64[ns]
----------------------------------------
0     3540.0
1     3720.0
2     4740.0
3     4920.0
4     4920.0
       ...
95    4020.0
96    7140.0
97    5580.0
98    1800.0
99    2100.0
Name: 지연시간, Length: 100, dtype: float64
----------------------------------------

In [122]:
print(df['지연시간'].dt.total_seconds()/60)

0      59.0
1      62.0
2      79.0
3      82.0
4      82.0
      ...
95     67.0
96    119.0
97     93.0
98     30.0
99     35.0
Name: 지연시간, Length: 100, dtype: float64

In [123]:
df['지연시간(분)'] = df['지연시간'].dt.total_seconds()/60
df.head(3)

,소방서,출발시간,도착시간,start,end,지연시간,지연시간(분)
0,4,2023-01-01 00:00:00,2023-01-01 00:59:00,2023-01-01 00:00:00,2023-01-01 00:59:00,0 days 00:59:00,59.0
1,8,2023-01-01 01:00:00,2023-01-01 02:02:00,2023-01-01 01:00:00,2023-01-01 02:02:00,0 days 01:02:00,62.0
2,6,2023-01-01 02:00:00,2023-01-01 03:19:00,2023-01-01 02:00:00,2023-01-01 03:19:00,0 days 01:19:00,79.0

In [ ]:
s